{
  "metadata": {
      "title": "Ant's Adventure: Inside the Sleeper",
      "author": "Eldorado Games",
      "description": "In this whimsical game, the player controls a brave ant embarking on a daring expedition inside the body of a sleeping human. From the mouth to the lung and ultimately the brain, the ant must navigate through various challenges, puzzles, and encounters to uncover the mysteries of the slumbering mind."
  },
  "map": {
      "start_location_id": "176436023351190757029867458961641623027",
      "locations": {
          "176436023351190757029867458961641623027": {
              "name": "Mouth Mayhem",
              "text": "You, a tiny ant, find yourself exploring the vast landscape of a sleeping human's face.\n\nAs you stand on the precipice of their parted lips, you can hear the soft sound of their breath and catch a glimpse of the mysterious darkness that lies within. Steeling yourself for what lies ahead, you summon your bravery and decide to enter the ominous maw before you.\n\nYou see rows of glistening teeth and a moist cavern beyond. Saliva drips from the fleshy walls, and the sound of muffled whispers fills the air. The air is thick with the scent of toothpaste and mint.",
              "exits": {
                  "E": {
                      "location_id": "103398656305389756482782927758875763043",
                      "text": "Go down the throat."
                  },
                  "S": {
                      "location_id": "37268514198511913402422787247111950697",
                      "text": "Explore a fleshy and agile appendage in front of you."
                  }
              }
          },
          "103398656305389756482782927758875763043": {
              "name": "Lung Labyrinth",
              "text": "Leaving behind the mysterious mouth, you continue your extraordinary journey and find yourself within the intricate confines of the lung. The air around you feels charged with life as you navigate the twisting passageways and observe the rhythmic expansion and contraction of the lung tissue. The walls pulsate with each breath, propelling you forward into the vast network of air sacs and bronchial tubes. The gentle rustling sound of oxygen fills the atmosphere, reminding you of the vital role these lungs play in the human body.",
              "exits": {
                  "E": {
                      "location_id": "278800096026553313332230853415159819861",
                      "text": "Start walking"
                  },
                  "S": {
                      "location_id": "212465162828913305870986656741184781021",
                      "text": "Look up"
                  }
              }
          },
          "37268514198511913402422787247111950697": {
              "name": "Mischievous Tongue",
              "text": "You come across a playful, mischievous tongue swirling within the mouth. It looks at you with a glint of mischief in its eyes. You tickle the tongue, and it bursts into uncontrollable laughter. The tongue accidentally crushes you, ending your life.",
              "exits": {},
              "is_end_location": true
          },
          "278800096026553313332230853415159819861": {
              "name": "Mucus Trap",
              "text": "As you make your way through the lung labyrinth, you stumble upon a sticky mucus trap, blocking your path. Despite your best efforts to break free from the mucus trap, the sticky substance proves to be overpowering. You struggle and strain against its grip, but it holds you firmly in its clutches. Exhausted and defeated, you succumb to the trap's relentless grasp, unable to break free. The mucus envelops you completely, gradually sapping your energy and sealing your fate. Trapped and unable to continue your quest, your journey ends here, lost within the confines of the mucus trap.",
              "exits": {},
              "is_end_location": true
          },
          "212465162828913305870986656741184781021": {
              "name": "Brain Boulevard",
              "text": "As you gaze up, you notice a swirling cloud of dust particles. They form a mesmerizing whirl, seemingly beckoning you towards a new location. You follow the particles leading you through a mysterious pathway. You find yourself standing on the Brain Boulevard, a pulsating thoroughfare within the intricate network of the human brain. As you explore, you notice a small lump at the center of the location, seemingly beckoning to you.",
              "exits": {
                  "E": {
                      "location_id": "47240928488440816721106225708366040353",
                      "text": "Bite the lump and see what happens."
                  },
                  "S": {
                      "location_id": "135786131355435842073763365789289397328",
                      "text": "Avoid the lump and continue exploring."
                  }
              }
          },
          "47240928488440816721106225708366040353": {
              "name": "Mind Control",
              "text": "Driven by curiosity, you lean in and cautiously take a bite of the mysterious lump. Suddenly, a surge of energy courses through your tiny ant body as an extraordinary transformation begins to unfold. The human body gradually becomes your own, merging your ant form with the newfound capabilities and experiences of the human brain. You have become an ant-human hybrid, able to live your ant-human life for as long as you desire. Congratulations! You have successfully achieved an extraordinary existence, embracing the complexities of both ant and human worlds.",
              "exits": {},
              "is_end_location": true
          },
          "135786131355435842073763365789289397328": {
              "name": "Dreadful End",
              "text": "Deciding to avoid the lump, you continue your exploration of the Brain Boulevard. However, as time passes, the intricate pathways of the brain cortex maze become increasingly bewildering and perplexing. You become disoriented and unable to find your way out. Exhausted and lost within the labyrinth of the brain, your tiny ant body succumbs to fatigue and ultimately perishes.",
              "exits": {},
              "is_end_location": true
          }
      }
  }
}